AccumulationRegisters/ЛимитыБюджетированияПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыБюджетированияПоСтатьям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VatNoVat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VatNoVat</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Стаття</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПериодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектУправленческий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыПериодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТриМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Бюджетирование/Ext/Module.bsl
Функция ПолучитьДанныеПоЛимитам(Подразделение,Проект,СтатьяДДС,Организация,Период) Экспорт 
	Типпериода = Неопределено;	
	ЕстьПроект = Ложь;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьям.ТипПериода
	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям КАК ЛимитыБюджетированияПоСтатьям
	               |ГДЕ
	               |	ЛимитыБюджетированияПоСтатьям.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЛимитыБюджетированияПоСтатьям.Подразделение = &Подразделение
	               |	И ЛимитыБюджетированияПоСтатьям.Статья = &Статья
	               |	И ЛимитыБюджетированияПоСтатьям.Проект = &Проект
	               |	И ЛимитыБюджетированияПоСтатьям.Организация = &Организация
	               |	И ЛимитыБюджетированияПоСтатьям.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Период));
	Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);

	Запрос.УстановитьПараметр("КонецПериода",КонецГода(Период));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));

	Запрос.УстановитьПараметр("Статья",СтатьяДДС);
	Запрос.УстановитьПараметр("Проект",Проект);
	
	РезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если не РезультатаЗапроса.Количество() Тогда 
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛимитыБюджетированияПоСтатьям.ТипПериода
		               |ИЗ
		               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям КАК ЛимитыБюджетированияПоСтатьям
		               |ГДЕ
		               |	ЛимитыБюджетированияПоСтатьям.Период МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ЛимитыБюджетированияПоСтатьям.Подразделение = &Подразделение
		               |	И ЛимитыБюджетированияПоСтатьям.Статья = &Статья
		               |	И ЛимитыБюджетированияПоСтатьям.Проект = &Проект
		               |	И ЛимитыБюджетированияПоСтатьям.Организация = &Организация
		               |	И ЛимитыБюджетированияПоСтатьям.ВидДвижения = &ВидДвижения";
		
		Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Период));
		Запрос.УстановитьПараметр("КонецПериода",КонецГода(Период));
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Запрос.УстановитьПараметр("Статья",СтатьяДДС);
		Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Проект",Справочники.Проекты.ПустаяСсылка());
		Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));


		
		РезультатаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатаЗапроса.Количество() Тогда 
			Типпериода = РезультатаЗапроса[0].ТипПериода; 
		КонецЕсли;
	Иначе
		Типпериода = РезультатаЗапроса[0].ТипПериода;
		ЕстьПроект = Истина;

	КонецЕсли;			
	
	
	Если Типпериода = Перечисления.ТипыПериодов.Месяц Тогда 
		ТипПериодаЗапроса = "Месяц";
		ПериодЗапроса = НачалоМесяца(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.ТриМесяца Тогда 
		ТипПериодаЗапроса = "Квартал";
		ПериодЗапроса = НачалоКвартала(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.ПодГода Тогда 
		ТипПериодаЗапроса = "Полугодие" ;
		ПериодЗапроса = НачалоПолугодия(Период);
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.Год Тогда 
		ТипПериодаЗапроса = "Год";
		ПериодЗапроса = НачалоГода(Период);	
	ИначеЕсли Типпериода = Перечисления.ТипыПериодов.БезОграничений Тогда
		ТипПериодаЗапроса = "";
		ПериодЗапроса =Период;
	Иначе
		ТипПериодаЗапроса = "";

		ПериодЗапроса =Период;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст  ="ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаОборот,
				   |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаПриход,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.СуммаРасход,
				   |    &ТипПериодаЗапросаБюджет как ТипПериодаЗапроса,
				   |    &ЕстьПроект как ЕстьПроект
				  

	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям.Обороты(
	               |			,
	               |			,"
				   +ТипПериодаЗапроса+",
	               |			Организация = &Организация
	               |				И Подразделение = &Подразделение
	               |				И Проект = &Проект
	               |				И Статья = &Статья) КАК ЛимитыБюджетированияПоСтатьямОбороты
				   |ГДЕ"+?(ТипПериодаЗапроса=""," Истина"," ЛимитыБюджетированияПоСтатьямОбороты.Период = &Период")+"
             	   |	";
				   
				   
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Запрос.УстановитьПараметр("Статья",СтатьяДДС);
		Запрос.УстановитьПараметр("Проект",?(ЕстьПроект,Проект,Справочники.Проекты.ПустаяСсылка()));
		Запрос.УстановитьПараметр("Организация",?(Организация.А_БухгалтерскийУчет,А_ОбщегоНазначения.ПолучитьОрганизациюУУ(Организация),Организация));
		Запрос.УстановитьПараметр("Период",ПериодЗапроса);
		Запрос.УстановитьПараметр("ТипПериодаЗапроса",ТипПериодаЗапроса);
		Запрос.УстановитьПараметр("ТипПериодаЗапросаБюджет",Типпериода); 
		Запрос.УстановитьПараметр("ЕстьПроект",ЕстьПроект);

		

		

				   
	РезультатЗапросаПоЛимитам = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапросаПоЛимитам.Количество() Тогда 
		Возврат РезультатЗапросаПоЛимитам[0];
	Иначе
		Возврат Новый Структура("СуммаОборот,СуммаПриход,СуммаРасход,ТипПериодаЗапроса,ЕстьПроект",0,0,0,Типпериода,ЕстьПроект);
	КонецЕсли;
	

	
КонецФункции


Функция НачалоПолугодия(Знач Дата) Экспорт
    
    ПервыйДеньГода = НачалоГода(Дата);
    ПервыйДеньИюля = НачалоМесяца(ДобавитьМесяц(ПервыйДеньГода, 6));
    
    Если Месяц(Дата) < 7 Тогда
        Возврат ПервыйДеньГода;
    Иначе
        Возврат ПервыйДеньИюля;
    КонецЕсли;
    
КонецФункции
